In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
df_NG_price = pd.read_csv('/home/dsc/Documents/TFM/Data/NatGas_Price/NaturalGas_Price_v2.csv')

In [39]:
df_NG_price.head()

         date   value
0  2008-04-14   10.03
1  2008-04-15   10.16
2  2008-04-16   10.11
3  2008-04-17   10.27
4  2008-04-18   10.08

In [40]:
type(df_NG_price)

pandas.core.frame.DataFrame

In [41]:
df_NG_price.dtypes

date       object
 value    float64
dtype: object

In [42]:
df_NG_price['date'] = pd.to_datetime(df_NG_price['date'])

In [43]:
df_NG_price.head()

        date   value
0 2008-04-14   10.03
1 2008-04-15   10.16
2 2008-04-16   10.11
3 2008-04-17   10.27
4 2008-04-18   10.08

In [44]:
df_NG_price.dtypes

date      datetime64[ns]
 value           float64
dtype: object

In [45]:
df_NG_price['Year']= df_NG_price['date'].apply(lambda x: x.year)
df_NG_price['Month']= df_NG_price['date'].apply(lambda x: x.month)
df_NG_price['Day']= df_NG_price['date'].apply(lambda x: x.day)

In [46]:
df_NG_price.head()

        date   value  Year  Month  Day
0 2008-04-14   10.03  2008      4   14
1 2008-04-15   10.16  2008      4   15
2 2008-04-16   10.11  2008      4   16
3 2008-04-17   10.27  2008      4   17
4 2008-04-18   10.08  2008      4   18

In [47]:
df_NG_price.columns

Index(['date', ' value', 'Year', 'Month', 'Day'], dtype='object')

In [48]:
columns = ['Date', 'NG_Price', 'Year', 'Month', 'Day']

In [49]:
df_NG_price.columns = columns

In [50]:
df_NG_price = df_NG_price[['Date', 'Year', 'Month', 'Day', 'NG_Price']]

In [51]:
df_NG_price.head()

        Date  Year  Month  Day  NG_Price
0 2008-04-14  2008      4   14     10.03
1 2008-04-15  2008      4   15     10.16
2 2008-04-16  2008      4   16     10.11
3 2008-04-17  2008      4   17     10.27
4 2008-04-18  2008      4   18     10.08

In [54]:
df_NG_price.to_csv('/home/dsc/Documents/TFM/Data/NatGas_Price/df_NaturalGas_Price.csv')